local addonName, addonTable = ...

local craftingData = {
	{
		min = 1,
		max = 44,
		craft = { "Рулон льняной ткани" },
		recipe = { "2x Льняной материал" },
	},
	{
		min = 45,
		max = 49,
		craft = { "Льняной пояс" },
		recipe = { "1x Рулон льняной ткани, 1x Грубая нить" },
	},
	{
		min = 50,
		max = 69,
		craft = { "Тяжелые льняные перчатки" },
		recipe = { "2x Рулон льняной ткани, 1x Грубая нить" },
	},
	{
		min = 70,
		max = 74,
		craft = { "Усиленная льняная накидка" },
		recipe = { "2x Рулон льняной ткани, 3x Грубая нить" },
	},
	{
		min = 75,
		max = 99,
		craft = { "Рулон шерсти" },
		recipe = { "3x Шерсть" },
	},
	{
		min = 100,
		max = 104,
		craft = { "Простой килт", "Шерстяная сумка" },
		recipe = {
			"4x Рулон льняной ткани, 1x Тонкая нить",
			"3x Рулон шерсти, 1x Тонкая нить",
		},
	},
	{
		min = 105,
		max = 109,
		craft = { "Простой килт" },
		recipe = { "4x Рулон льняной ткани, 1x Тонкая нить" },
	},
	{
		min = 110,
		max = 124,
		craft = { "Шерстяные наплечники с двойным швом" },
		recipe = { "3x Рулон шерсти, 2x Тонкая нить" },
	},
	{
		min = 125,
		max = 144,
		craft = { "Рулон шелка" },
		recipe = { "4x Шелковый материал" },
	},
	{
		min = 145,
		max = 159,
		craft = {
			"Лазурный шелковый капюшон",
			"Шерстяные наплечники с двойным швом",
		},
		recipe = {
			"2x Рулон шелка, 2x Синяя краска, 1x Тонкая нить",
			"3x Рулон шерсти, 2x Тонкая нить",
		},
	},
	{
		min = 160,
		max = 169,
		craft = { "Шелковая головная повязка" },
		recipe = { "3x Рулон шелка, 2x Тонкая нить" },
	},
	{
		min = 170,
		max = 174,
		craft = { "Церемониальная белая рубашка" },
		recipe = { "3x Рулон шелка, 2x Отбеливатель, 1x Тонкая нить" },
	},
	{
		min = 175,
		max = 184,
		craft = { "Рулон магической ткани" },
		recipe = { "4x Магическая ткань" },
	},
	{
		min = 185,
		max = 204,
		craft = { "Багровый шелковый жилет" },
		recipe = { "4x Рулон шелка, 2x Тонкая нить, 2x Красная краска" },
	},
	{
		min = 205,
		max = 214,
		craft = { "Багровые шелковые кюлоты" },
		recipe = { "4x Рулон шелка, 2x Красная краска, 2x Шелковая нить" },
	},
	{
		min = 215,
		max = 219,
		craft = {
			"Черные поножи из магической ткани",
			"Багровые шелковые кюлоты",
		},
		recipe = {
			"2x Рулон магической ткани, 3x Шелковая нить",
			"4x Рулон шелка, 2x Красная краска, 2x Шелковая нить",
		},
	},
	{
		min = 220,
		max = 229,
		craft = { "Черные перчатки из магической ткани" },
		recipe = { "2x Рулон магической ткани, 2x Толстая шелковая нить" },
	},
	{
		min = 230,
		max = 249,
		craft = { "Черная повязка из магической ткани" },
		recipe = { "3x Рулон магической ткани, 2x Толстая шелковая нить" },
	},
	{
		min = 250,
		max = 259,
		craft = { "Рулон рунической ткани" },
		recipe = { "4x Руническая ткань" },
	},
	{
		min = 260,
		max = 279,
		craft = { "Пояс из рунической ткани" },
		recipe = { "3x Рулон рунической ткани, 1x Руническая нить" },
	},
	{
		min = 280,
		max = 294,
		craft = { "Перчатки из рунической ткани" },
		recipe = { "5x Рулон рунической ткани, 2x Руническая нить" },
	},
	{
		min = 295,
		max = 299,
		craft = { "Головная повязка из рунической ткани" },
		recipe = { "6x Рулон рунической ткани, 2x Руническая нить" },
	},
	{
		min = 300,
		max = 324,
		craft = { "Рулон ткани Пустоты" },
		recipe = { "5x Ткань Пустоты" },
	},
	{
		min = 325,
		max = 334,
		craft = { "Рулон прочной ткани Пустоты" },
		recipe = { "3x Рулон ткани Пустоты, 2x Чародейная пыль" },
	},
	{
		min = 335,
		max = 344,
		craft = { "Сапоги из ткани Пустоты" },
		recipe = {
			"6x Рулон ткани Пустоты, 2x Узловатая кожа, 1x Руническая нить",
		},
	},
	{
		min = 345,
		max = 349,
		craft = { "Мундир из ткани Пустоты" },
		recipe = { "8x Рулон ткани Пустоты, 2x Руническая нить" },
	},
	{
		min = 350,
		max = 374,
		craft = { "Рулон ледяной ткани" },
		recipe = { "5x Ледяная ткань" },
	},
	{
		min = 375,
		max = 379,
		craft = { "Ледотканый пояс" },
		recipe = { "3x Рулон ледяной ткани, 1x Этерниевая нить" },
	},
	{
		min = 380,
		max = 384,
		craft = { "Ледотканые сапоги" },
		recipe = { "4x Рулон ледяной ткани, 1x Этерниевая нить" },
	},
	{
		min = 385,
		max = 394,
		craft = { "Ледотканый шлем" },
		recipe = { "5x Рулон ледяной ткани, 1x Этерниевая нить" },
	},
	{
		min = 395,
		max = 399,
		craft = { "Пояс из сумеречной ткани" },
		recipe = { "7x Рулон ледяной ткани, 1x Этерниевая нить" },
	},
	{
		min = 400,
		max = 404,
		craft = { "Рулон прочной ледяной ткани" },
		recipe = { "2x Рулон ледяной ткани, 2x Абсолютная пыль" },
	},
	{
		min = 405,
		max = 409,
		craft = { "Напульсники из сумеречной ткани" },
		recipe = { "8x Рулон ледяной ткани, 1x Этерниевая нить" },
	},
	{
		min = 410,
		max = 414,
		craft = { "Перчатки из сумеречной ткани" },
		recipe = { "9x Рулон ледяной ткани, 1x Этерниевая нить" },
	},
	{
		min = 415,
		max = 424,
		craft = {
			"Сапоги из сумеречной ткани",
			"Наплечники из сумеречной ткани",
		},
		recipe = {
			"10x Рулон ледяной ткани, 1x Этерниевая нить",
			"10x Рулон ледяной ткани, 1x Этерниевая нить",
		},
	},
	{
		min = 425,
		max = 449,
		craft = { "Сумка из ледяной ткани" },
		recipe = { "6x Рулон прочной ледяной ткани, 2x Этерниевая нить" },
	},
}

addonTable.getTailoring = function(rank)
	for _, data in ipairs(craftingData) do
		if rank >= data.min and rank <= data.max then
			return data.craft, data.recipe
		end
	end
	return nil, nil -- Return nil if no match is found
end

print("[Profession Capper] loaded Tailoring module")
